org-files/mastodon.org
:PROPERTIES:
:ID:       8afa947a-6ea7-4302-8af2-9980e2a44a62
:END:
#+title: mastodon
#+STARTUP: overview
#+date: 2024-09-18
#+filetags: apps

* Migrando de instancia
Voy a migrar de emacs.ch a mas.to y estos son los pasos que he seguido

- Crear una nueva cuenta en mas.to
- Descargar lista de cuentas a las que sigo desde [[https://emacs.ch][emacs.ch]]
  - Acceder a [[https://emacs.ch/settings/export][/settings/export]]
  - Descargar el archivo "[[https://emacs.ch/settings/exports/follows.csv][following_accounts.csv]]"
- Crear [[https://mas.to/settings/aliases][alias]] en la nueva instancia para migrar hacia esta la vieja cuenta
- Configurar la redirección a la cuenta nueva en emacs.ch
  - Acceder a la [[https://emacs.ch/settings/migration][/settings/migration]]
- Importar [[https://mas.to/settings/imports][lista de seguidos]] en la nueva instancia

* Verificar la identidad en Hugo
En el "footer.html" añadimos lo siguiente
#+begin_src html
  <a rel="me" href="https://mas.to/@sherlockes">Mastodon</a>
#+end_src

Con esto funciona sólo que el enlace es visible, lo podemos cambiar por
#+begin_src html
  <link rel="me" href="https://mas.to/@sherlockes">
#+end_src
