public_html/mastodon.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mastodon</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">mastodon</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org364628d">1. Migrando de instancia</a></li>
<li><a href="#org0e8d700">2. Verificar la identidad en Hugo</a></li>
</ul>
</div>
</div>

<div id="outline-container-org364628d" class="outline-2">
<h2 id="org364628d"><span class="section-number-2">1.</span> Migrando de instancia</h2>
<div class="outline-text-2" id="text-1">
<p>
Voy a migrar de emacs.ch a mas.to y estos son los pasos que he seguido
</p>

<ul class="org-ul">
<li>Crear una nueva cuenta en mas.to</li>
<li>Descargar lista de cuentas a las que sigo desde <a href="https://emacs.ch">emacs.ch</a>
<ul class="org-ul">
<li>Acceder a <a href="https://emacs.ch/settings/export">/settings/export</a></li>
<li>Descargar el archivo "<a href="https://emacs.ch/settings/exports/follows.csv">following<sub>accounts.csv</sub></a>"</li>
</ul></li>
<li>Crear <a href="https://mas.to/settings/aliases">alias</a> en la nueva instancia para migrar hacia esta la vieja cuenta</li>
<li>Configurar la redirección a la cuenta nueva en emacs.ch
<ul class="org-ul">
<li>Acceder a la <a href="https://emacs.ch/settings/migration">/settings/migration</a></li>
</ul></li>
<li>Importar <a href="https://mas.to/settings/imports">lista de seguidos</a> en la nueva instancia</li>
</ul>
</div>
</div>

<div id="outline-container-org0e8d700" class="outline-2">
<h2 id="org0e8d700"><span class="section-number-2">2.</span> Verificar la identidad en Hugo</h2>
<div class="outline-text-2" id="text-2">
<p>
En el "footer.html" añadimos lo siguiente
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #cae682;">a</span> <span style="color: #cae682;">rel</span>=<span style="color: #95e454;">"me"</span> <span style="color: #cae682;">href</span>=<span style="color: #95e454;">"https://mas.to/@sherlockes"</span>&gt;Mastodon&lt;/<span style="color: #cae682;">a</span>&gt;
</pre>
</div>

<p>
Con esto funciona sólo que el enlace es visible, lo podemos cambiar por
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #cae682;">link</span> <span style="color: #cae682;">rel</span>=<span style="color: #95e454;">"me"</span> <span style="color: #cae682;">href</span>=<span style="color: #95e454;">"https://mas.to/@sherlockes"</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-09-18</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
